Autodesk.Revit.DB.Parameter.ClearValue
Clears the parameter to its initial value.
Returns: The ClearValue method will return True if the parameter was successfully cleared to its initial value, otherwise false.
Remarks: This method will only succeed for Shared parameters that have their HideWhenNoValue property set to true.
Since: 2020
Throws Autodesk.Revit.Exceptions.InvalidOperationException: The parameter is read-only, or the parameter is not a shared parameter,
or the shared parameter has HideWhenNoValue set to false.

Autodesk.Revit.DB.Parameter.AsDoubleInForgeStorageUnit
Provides access to the double precision number within the parameter, converted to the Forge storage
unit of the parameter's data type.
Remarks: This method should only be used if the StorageType property returns that the internal
contents of the parameter is a double.
Returns: The double value contained in the parameter quantified in its Forge storage unit.

Autodesk.Revit.DB.Parameter.GetUnitTypeId
Gets the identifier of the unit quantifying the parameter value.
Returns: Identifier of the unit of the parameter.
Remarks: The property only applies to parameters of value types.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown if this parameter is not of value type.

Autodesk.Revit.DB.Parameter.GetTypeId
Gets the identifier of the parameter.
Since:
2022